#+TITLE: Lesson 3
* Lesson 3
** Introduction
*** Software tools
1. Language
2. Functions
** Regular Expressions Review
*** Find substring string

- Use find function ::
#+begin_src python
s = 'some long thing with words'
s.find('word') => 21 (-1)
#+end_src
- Use re ::
#+begin_src python
  re.search('baa*!', s)
#+end_src
*** Regular Expressions
| special | example | match               | meaning                                   |
|---------+---------+---------------------+-------------------------------------------|
| *       | a*      | '', a, aa, aaa, ... | any length of repeat of the previous char |
| ?       | a?      | '', a               | zero or one appearence                    |
| .       | .       | a, b, c, 7, !,...   | any single character                      |
| ^       | ^b      | ba, bb, ...         | beginning of the line                     |
| $       | a$      | ba, aa              | end of the line                           |
| ''      | ''      | ''                  | empty string                              |
| a       | a       | a                   | single character                          |
** Regular Expressions Review
*** [[./rer_quiz1.py][Quiz 1]]
*** [[./rer_quiz2.py][Quiz 2]]
*** [[./rer_quiz3.py][Quiz 3]]
** Language
*** Python
1. Statements
2. Expressions
3. Format
4. Class - operator overloading
*** Domain Specific Language
** The Language of Regular Expressions
*** Grammar
A description for a specific Language
*** API
Application Programming interface
**** Exp:
| lit(s)    | lit('a')                | {a}             |
| seq(x, y) | seq(lit('a'), lit('b')) | {ab}            |
| alt(x, y) | alt(lit('a'), lit('b')) | {a, b}          |
| star(x)   | star(lit('a'))          | {'', a, aa,...} |
| oneof(c)  | oneof('abc')            | {a, b, c}       |
| eol       | eol                     | {''}            |
| dot       | dot                     | {a, b, c, ...}  |
** Specifications
** Concept Inventory
- pattern
- text —— result
- control over iteration
- partial result
'a*b+' -> 'aaab' -> 'ab' or 'aab' or 'aaab'
[[./matchset.py][set of remainders]]
** [[./filling_out_the_api.py][Filling Out The API]]
** [[./search_and_match.py][Search and Match]]
- match(p, t) ::
Match pattern against start of text; return longest match found or None.
- search(p, t) ::
Match pattern anywhere in text; return longest earliest match or None.
- matchset(p, t) ::
Match pattern at start of text; return a set of remainders of text.
** Compiling
| pattern      | lanuage         | compiler                     |
|--------------+-----------------+------------------------------|
| (a \vert b)+ | {a,b,ab,ba,...} | compile(pattern)->c->c(text) |
** Lower Level Compilers
#+begin_src python
pat = lit('a')
pat
>>> function<lambda> ...
pat('a string')
>>> set([' string'])

pat2 = plus(pat)
pat2
>>> function<lambda> ...
pat2('aaaaab')

matchset(pat2, 'aaaaab')
#+end_src

*** Pros
- Python Functions :: flexibility
- Language VM :: Machine Instructions
** [[./alt.py][Alt]]
** [[./simple_compilers.py][Simple Compilers]]
** Recognizers and Generators
- Recognizers :: match(pat, text) -> txt | None
- Generator :: gen(pat) -> L
  - Finite Language :: (a | b)(a | b) = {aa, ab, ba, bb}
  - Inifinite Language ::
       a* = { , a, aa, aaa, ...}

       pat({int}) -> {str}

       pat = a*

       pat({1, 2, 3}) -> {a, aa, aaa}
** Avoid Repetition
** Genseq
** Induction
:LOGBOOK:
CLOCK: [2015-02-25 Wed 10:10]--[2015-02-25 Wed 10:12] =>  0:02
:END:
[2015-02-25 Wed 10:10]
*** Star
*** Plus
*** Induction
Ns = 1
** Testing Genseq
:LOGBOOK:
CLOCK: [2015-02-25 Wed 10:13]--[2015-02-25 Wed 10:15] =>  0:02
:END:
[2015-02-25 Wed 10:13]
** Theory and Practice
:LOGBOOK:
CLOCK: [2015-02-25 Wed 10:16]--[2015-02-25 Wed 10:33] =>  0:17
:END:
[2015-02-25 Wed 10:15]
** Theory
[2015-02-25 Wed 10:20]

pattern + grammer -> language

interpreter -> grammer

compiler -> pattern
** Practice
- reg exp ::
- interpreters :: more expresive and more natural
- functions ::
              more composable

              and give us the ability to control over
              time (do it now or do it later)
[2015-02-25 Wed 10:21]
** Changing Seq
:LOGBOOK:
CLOCK: [2015-02-25 Wed 10:34]--[2015-02-25 Wed 10:45] =>  0:11
:END:
[2015-02-25 Wed 10:34]
*** Refactoring
[2015-02-25 Wed 10:39]
- Backward compatible
- Internal / External
** Changing Functions
[2015-02-25 Wed 10:45]
** Function Mapping
:LOGBOOK:
CLOCK: [2015-02-25 Wed 10:46]--[2015-02-25 Wed 10:47] =>  0:01
:END:
[2015-02-25 Wed 10:46]
Adapter
** Update Wrapper
[2015-02-25 Wed 13:31]
** Decorated Wrappers
:LOGBOOK:
CLOCK: [2015-02-25 Wed 13:31]--[2015-02-25 Wed 13:33] =>  0:02
:END:
[2015-02-25 Wed 13:31]
A decorator can be decorated by another decorator
** Decorated Decorators
:LOGBOOK:
CLOCK: [2015-02-25 Wed 13:33]--[2015-02-25 Wed 13:35] =>  0:02
:END:
[2015-02-25 Wed 13:33]
** Cache Management
:LOGBOOK:
CLOCK: [2015-02-25 Wed 13:36]--[2015-02-25 Wed 13:41] =>  0:05
:END:
[2015-02-25 Wed 13:36]
*** Memoization
[2015-02-25 Wed 13:36]
** Save Time Now
:LOGBOOK:
CLOCK: [2015-02-25 Wed 13:43]--[2015-02-25 Wed 13:51] =>  0:08
:END:
[2015-02-25 Wed 13:42]
Successive element / the element -> Golden Ratio
Fibonacci Func Call Counts / Fibonacci result -> Golden Ratio
** Trace Tool
:LOGBOOK:
CLOCK: [2015-02-25 Wed 15:02]--[2015-02-25 Wed 15:45] =>  0:43
CLOCK: [2015-02-25 Wed 14:47]--[2015-02-25 Wed 14:49] =>  0:02
CLOCK: [2015-02-25 Wed 13:51]--[2015-02-25 Wed 14:01] =>  0:10
:END:
[2015-02-25 Wed 13:51]
*** Types of Tools
[2015-02-25 Wed 13:52]
| Debug Tool | Performance Tool | Expresiveness Tool |
| countcalls | memo             | n_ary              |
| Trace      |                  |                    |

Trace -> A decorator to trace a recursive function
** Disable Decorator
:LOGBOOK:
CLOCK: [2015-02-25 Wed 15:45]--[2015-02-25 Wed 15:50] =>  0:05
:END:
[2015-02-25 Wed 15:45]
#+begin_src python
def disabled(f): return f
trace = disabled
#+end_src
** Back to Languages
:LOGBOOK:
CLOCK: [2015-02-25 Wed 15:50]--[2015-02-25 Wed 15:59] =>  0:09
:END:
[2015-02-25 Wed 15:50]
Context Free Lanuages
** Writting Grammar
:LOGBOOK:
CLOCK: [2015-02-25 Wed 15:59]--[2015-02-25 Wed 16:13] =>  0:14
:END:
[2015-02-25 Wed 15:59]
| Grammer                       | Language |
| Exp => Term[-+]Exp \vert Term |          |
| ...                           |          |
** Descriptionary
[2015-03-01 Sun 14:45]
** White Space
[2015-03-01 Sun 14:45]
** Parsing
[2015-03-01 Sun 14:45]
- Recognizer :: only recognize that if there is a regex in the given string
- Parser :: not only recognize but also give a structure of the string
** Speedy Parsing
[2015-03-01 Sun 14:55]
* Catching typos
[2015-03-01 Sun 15:46]
* Summary
[2015-03-01 Sun 15:46]
** Tools - components
[2015-03-01 Sun 15:47]
*** Language
[2015-03-01 Sun 16:02]
- Grammar
- Interpreter
- Compiler
*** Functions
- compose
- object
[2015-03-01 Sun 16:03]
